{"class_name": "Model", "config": {"name": "model_50", "layers": [{"name": "input_99", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 133, 8], "dtype": "float32", "sparse": false, "name": "input_99"}, "inbound_nodes": []}, {"name": "input_100", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 266, 133], "dtype": "float32", "sparse": false, "name": "input_100"}, "inbound_nodes": []}, {"name": "multi_graph_cnn_50", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_50", "trainable": true, "output_dim": 128, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_99", 0, 0, {}], ["input_100", 0, 0, {}]]]}, {"name": "dropout_50", "class_name": "Dropout", "config": {"name": "dropout_50", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_50", 0, 0, {}]]]}, {"name": "multi_graph_cnn_51", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_51", "trainable": true, "output_dim": 64, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_50", 0, 0, {}], ["input_100", 0, 0, {}]]]}, {"name": "dropout_51", "class_name": "Dropout", "config": {"name": "dropout_51", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_51", 0, 0, {}]]]}, {"name": "multi_graph_cnn_52", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_52", "trainable": true, "output_dim": 32, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_51", 0, 0, {}], ["input_100", 0, 0, {}]]]}, {"name": "dropout_52", "class_name": "Dropout", "config": {"name": "dropout_52", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_52", 0, 0, {}]]]}, {"name": "multi_graph_cnn_53", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_53", "trainable": true, "output_dim": 16, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_52", 0, 0, {}], ["input_100", 0, 0, {}]]]}, {"name": "dropout_53", "class_name": "Dropout", "config": {"name": "dropout_53", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_53", 0, 0, {}]]]}, {"name": "conv1d_122", "class_name": "Conv1D", "config": {"name": "conv1d_122", "trainable": true, "filters": 256, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_53", 0, 0, {}]]]}, {"name": "conv1d_123", "class_name": "Conv1D", "config": {"name": "conv1d_123", "trainable": true, "filters": 128, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_122", 0, 0, {}]]]}, {"name": "conv1d_124", "class_name": "Conv1D", "config": {"name": "conv1d_124", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_123", 0, 0, {}]]]}, {"name": "conv1d_125", "class_name": "Conv1D", "config": {"name": "conv1d_125", "trainable": true, "filters": 32, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_124", 0, 0, {}]]]}, {"name": "average_pooling1d_50", "class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_50", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_125", 0, 0, {}]]]}, {"name": "flatten_50", "class_name": "Flatten", "config": {"name": "flatten_50", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling1d_50", 0, 0, {}]]]}, {"name": "dense_99", "class_name": "Dense", "config": {"name": "dense_99", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_50", 0, 0, {}]]]}, {"name": "activation_99", "class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["dense_99", 0, 0, {}]]]}, {"name": "dense_100", "class_name": "Dense", "config": {"name": "dense_100", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_99", 0, 0, {}]]]}, {"name": "activation_100", "class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["dense_100", 0, 0, {}]]]}], "input_layers": [["input_99", 0, 0], ["input_100", 0, 0]], "output_layers": [["activation_100", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}