{"class_name": "Model", "config": {"name": "model_157", "layers": [{"name": "input_315", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 111, 8], "dtype": "float32", "sparse": false, "name": "input_315"}, "inbound_nodes": []}, {"name": "input_316", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 222, 111], "dtype": "float32", "sparse": false, "name": "input_316"}, "inbound_nodes": []}, {"name": "multi_graph_cnn_206", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_206", "trainable": true, "output_dim": 128, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_315", 0, 0, {}], ["input_316", 0, 0, {}]]]}, {"name": "dropout_206", "class_name": "Dropout", "config": {"name": "dropout_206", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_206", 0, 0, {}]]]}, {"name": "multi_graph_cnn_207", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_207", "trainable": true, "output_dim": 64, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_206", 0, 0, {}], ["input_316", 0, 0, {}]]]}, {"name": "dropout_207", "class_name": "Dropout", "config": {"name": "dropout_207", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_207", 0, 0, {}]]]}, {"name": "multi_graph_cnn_208", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_208", "trainable": true, "output_dim": 32, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_207", 0, 0, {}], ["input_316", 0, 0, {}]]]}, {"name": "dropout_208", "class_name": "Dropout", "config": {"name": "dropout_208", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_208", 0, 0, {}]]]}, {"name": "multi_graph_cnn_209", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_209", "trainable": true, "output_dim": 16, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_208", 0, 0, {}], ["input_316", 0, 0, {}]]]}, {"name": "dropout_209", "class_name": "Dropout", "config": {"name": "dropout_209", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_209", 0, 0, {}]]]}, {"name": "conv1d_389", "class_name": "Conv1D", "config": {"name": "conv1d_389", "trainable": true, "filters": 256, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_209", 0, 0, {}]]]}, {"name": "conv1d_390", "class_name": "Conv1D", "config": {"name": "conv1d_390", "trainable": true, "filters": 128, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_389", 0, 0, {}]]]}, {"name": "conv1d_391", "class_name": "Conv1D", "config": {"name": "conv1d_391", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_390", 0, 0, {}]]]}, {"name": "conv1d_392", "class_name": "Conv1D", "config": {"name": "conv1d_392", "trainable": true, "filters": 32, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_391", 0, 0, {}]]]}, {"name": "average_pooling1d_157", "class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_157", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_392", 0, 0, {}]]]}, {"name": "flatten_157", "class_name": "Flatten", "config": {"name": "flatten_157", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling1d_157", 0, 0, {}]]]}, {"name": "dense_313", "class_name": "Dense", "config": {"name": "dense_313", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_157", 0, 0, {}]]]}, {"name": "activation_313", "class_name": "Activation", "config": {"name": "activation_313", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["dense_313", 0, 0, {}]]]}, {"name": "dense_314", "class_name": "Dense", "config": {"name": "dense_314", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_313", 0, 0, {}]]]}, {"name": "activation_314", "class_name": "Activation", "config": {"name": "activation_314", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["dense_314", 0, 0, {}]]]}], "input_layers": [["input_315", 0, 0], ["input_316", 0, 0]], "output_layers": [["activation_314", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}