{"class_name": "Model", "config": {"name": "model_97", "layers": [{"name": "input_193", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 116, 8], "dtype": "float32", "sparse": false, "name": "input_193"}, "inbound_nodes": []}, {"name": "input_194", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 232, 116], "dtype": "float32", "sparse": false, "name": "input_194"}, "inbound_nodes": []}, {"name": "multi_graph_cnn_145", "class_name": "MultiGraphCNN", "config": {"name": "multi_graph_cnn_145", "trainable": true, "output_dim": 16, "num_filters": 2, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_193", 0, 0, {}], ["input_194", 0, 0, {}]]]}, {"name": "dropout_145", "class_name": "Dropout", "config": {"name": "dropout_145", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["multi_graph_cnn_145", 0, 0, {}]]]}, {"name": "conv1d_241", "class_name": "Conv1D", "config": {"name": "conv1d_241", "trainable": true, "filters": 256, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_145", 0, 0, {}]]]}, {"name": "conv1d_242", "class_name": "Conv1D", "config": {"name": "conv1d_242", "trainable": true, "filters": 128, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_241", 0, 0, {}]]]}, {"name": "conv1d_243", "class_name": "Conv1D", "config": {"name": "conv1d_243", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_242", 0, 0, {}]]]}, {"name": "conv1d_244", "class_name": "Conv1D", "config": {"name": "conv1d_244", "trainable": true, "filters": 32, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_243", 0, 0, {}]]]}, {"name": "average_pooling1d_97", "class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_97", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_244", 0, 0, {}]]]}, {"name": "flatten_97", "class_name": "Flatten", "config": {"name": "flatten_97", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling1d_97", 0, 0, {}]]]}, {"name": "dense_193", "class_name": "Dense", "config": {"name": "dense_193", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_97", 0, 0, {}]]]}, {"name": "activation_193", "class_name": "Activation", "config": {"name": "activation_193", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["dense_193", 0, 0, {}]]]}, {"name": "dense_194", "class_name": "Dense", "config": {"name": "dense_194", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_193", 0, 0, {}]]]}, {"name": "activation_194", "class_name": "Activation", "config": {"name": "activation_194", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["dense_194", 0, 0, {}]]]}], "input_layers": [["input_193", 0, 0], ["input_194", 0, 0]], "output_layers": [["activation_194", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}